{"sections":{"main":{"type":"faq-header","settings":{"title":"FAQ","use_h1":false,"text":"","show_search":true,"show_index":true,"index_heading":"How can we help?"}},"faq-content-1":{"type":"collapsible-tabs","blocks":{"question-1":{"type":"question","settings":{"title":"What size should I order?","answer":"<p>We provide a detailed size chart on the product page to help you find the perfect fit.If you're unsure or the size chart isn't available, our customer service team will be happy to offer personalized advice.<\/p>"}},"question-2":{"type":"question","settings":{"title":"What payment methods do you accept?","answer":"<p>We accept, Credit cards, Google Pay, Apple Pay, and Shop Pay to make the payment process quick and easy.<\/p>"}},"question_4Gt8R9":{"type":"question","settings":{"title":"Why haven't I received an order confirmation?","answer":"<p>You should receive an order confirmation email immediately after placing your order. This email includes your order number (at least 6 digits), a summary of your order, and your shipping address. Sometimes, confirmation emails may be mistakenly filtered into your spam or junk folder. Please take a moment to check these folders in your email account to see if the confirmation email is there.                  If you’ve checked your spam folder, waited a bit, and verified your email address, but still haven’t received your order confirmation, please contact our customer support team. Provide us with your order details, including your full name and order number, and we will help you check the status of your order and resend the confirmation email if necessary.<\/p>"}},"question_HbemCN":{"type":"question","settings":{"title":"Can I cancel my order?","answer":"<p>Yes, you can cancel your order within 12 hours of placing it by contacting us as soon as possible. However, please note that we use an automated processing system to ensure quick shipping. This means that even if your cancellation request is sent within the 12-hour window, we may not be able to cancel your order if it has already been processed or shipped by the time we review your email.                                   We do our best to respond to all emails quickly, but once an order has been processed, changes or cancellations are no longer possible. If your order has already been shipped, we recommend reviewing our return policy and waiting for the package to arrive before submitting a return request.<\/p>"}},"question_4HWyXH":{"type":"question","settings":{"title":"Can I modify my order?","answer":"<p>If your order has not yet been processed, it may still be possible to make changes. Since we process orders quickly, please contact us immediately to check if any modifications can be made.<\/p>"}},"question_4PGTVP":{"type":"question","settings":{"title":"How can I use my giftcard?","answer":"<p>During the checkout process, you will have the option to enter your gift card or voucher code in the designated field. After entering your code, click the \"Apply\" button to use your gift card or voucher. The total amount will be adjusted accordingly. Once your gift card or voucher has been successfully applied, continue with the checkout process as usual. Review your order details, enter any additional required information, and complete your purchase.If you experience any issues when using your gift card or voucher, feel free to contact our customer support team for assistance. We are here to ensure you have a smooth and pleasant shopping experience.<\/p>"}},"question_rfyFkF":{"type":"question","settings":{"title":"Will I be charged VAT?","answer":"<p>We ship directly from our supplier, so VAT is charged by the carrier upon delivery, not by us. If you require an invoice, please request it from the carrier.<\/p>"}}},"block_order":["question-1","question-2","question_4Gt8R9","question_HbemCN","question_4HWyXH","question_4PGTVP","question_rfyFkF"],"settings":{"title":"Ordering"}},"faq-content-2":{"type":"collapsible-tabs","blocks":{"question-1":{"type":"question","settings":{"title":"What is the delivery time?","answer":"<p>Delivery usually takes between 8 and 12 business days.<\/p>"}},"question-2":{"type":"question","settings":{"title":"What are the shipping costs?","answer":"<p>Shipping is always free. However, if you choose to exchange an item, return shipping fees may apply. These fees are calculated based on the weight of the package.<\/p>"}},"question_CAzUEG":{"type":"question","settings":{"title":"How can I track my order?","answer":"<p>You should receive an order confirmation email immediately after placing your order. This email includes your order number (at least 6 digits), a summary of your order, and your shipping address. Sometimes, confirmation emails may be mistakenly filtered into your spam or junk folder. Please take a moment to check these folders in your email account to see if the confirmation email is there.                  If you’ve checked your spam folder, waited a bit, and verified your email address, but still haven’t received your order confirmation, please contact our customer support team. Provide us with your order details, including your full name and order number, and we will help you check the status of your order and resend the confirmation email if necessary.<\/p>"}},"question_aprFrL":{"type":"question","settings":{"title":"What should I do if my tracking hasn't been updated?","answer":"<p>Tracking updates can sometimes be delayed, even if your package is already on its way. Please wait 3 to 5 business days for the tracking information to sync. If you still don't see any updates after that time, feel free to contact us for assistance. We'll help you track down the status of your order.<\/p>"}},"question_DxXRBV":{"type":"question","settings":{"title":"I entered the wrong delivery address. Can it be corrected?","answer":"<p>If you realize the mistake shortly after placing your order, contact our customer support team immediately. The sooner you reach out to us, the better the chances of correcting the address before shipment.If your order has already been processed or shipped and you cannot update the address through our support team, contact the carrier directly. Depending on the carrier's policies, you may be able to request a redirection or rerouting of the package to the correct address. This often involves additional fees and depends on the carrier's approval.To avoid similar issues in the future, always double-check your delivery address before finalizing your order. Ensure that all details, including apartment numbers, street names, and postal codes, are accurate.<\/p>"}},"question_c7Haqj":{"type":"question","settings":{"title":"My package was delivered to a pickup point. What should I do?","answer":"<p>Check your delivery notice or tracking information to locate the pickup point where your package was delivered. If you cannot find the location, contact the carrier directly for assistance in identifying the correct address.Once you have the details, be sure to pick up your package within the specified timeframe, as unclaimed packages may be returned to us.If you are unable to locate the pickup point or have any questions about the process, please don’t hesitate to contact our customer support team for assistance. Please note that if the package is not picked up in time and is returned, you may not be eligible for a full refund.<\/p>"}},"question_fGJQyn":{"type":"question","settings":{"title":"My package has been returned to the sender. What should I do?","answer":"<p>Please contact us so that we can resolve the situation as soon as possible.<\/p>"}}},"block_order":["question-1","question-2","question_CAzUEG","question_aprFrL","question_DxXRBV","question_c7Haqj","question_fGJQyn"],"settings":{"title":"Delivery"}},"collapsible_tabs_GhCD97":{"type":"collapsible-tabs","blocks":{"question_WNBaf3":{"type":"question","settings":{"title":"What is the return period?","answer":"<p>You can return your order within 30 days of receiving it.<\/p>"}},"question_ehMBNP":{"type":"question","settings":{"title":"How do I return my order?","answer":"<p>Please review our return policy<\/p>"}},"question_EmTRbA":{"type":"question","settings":{"title":"What is the return address?","answer":"<p>The return address and detailed instructions will be included in the return form, which we will provide once you contact us regarding your return request.<\/p>"}},"question_8qaqh7":{"type":"question","settings":{"title":"Are returns free of charge?","answer":"<p>Returns are not free, so the customer is responsible for the return shipping fees. These fees generally range from £17.50-£30 per package, plus customs fees of £10-£12.50, which are not covered by us. Heavier items, such as thick sweaters, jackets, or multiple pairs of shoes, may incur higher return fees, as these costs are calculated based on the weight of the package.<\/p>"}},"question_6KTpr6":{"type":"question","settings":{"title":"When will I be refunded?","answer":"<p>Refunds are processed via the original payment method. This usually takes up to 5 business days, depending on your bank.<\/p>"}},"question_qgnixC":{"type":"question","settings":{"title":"What is the return processing time?","answer":"<p>Returns are typically processed within 2 to 4 weeks, depending on shipping times. Once your return arrives at our facility in China, it will be processed within 5 business days.If your return is approved, you will receive a full refund. However, if your return is rejected, no refund will be issued, and the package will be sent back to you at no additional charge. Rejected returns may include damaged, incorrect, or used items.<\/p>"}},"question_8jt7RH":{"type":"question","settings":{"title":"What should I do if I want to return my order after the return period?","answer":"<p>We have a 30-day return period from the date you receive your package, during which you can return the item without providing a reason. Please note that the return package must be shipped within these 30 days.<\/p>"}}},"block_order":["question_WNBaf3","question_ehMBNP","question_EmTRbA","question_8qaqh7","question_6KTpr6","question_qgnixC","question_8jt7RH"],"settings":{"title":"Returns"}},"collapsible_tabs_kFc87r":{"type":"collapsible-tabs","blocks":{"question_EqJKCg":{"type":"question","settings":{"title":"Can I exchange my order?","answer":"<p>Yes, exchanges can be made within 30 days of receiving your order.<\/p>"}},"question_HteYGX":{"type":"question","settings":{"title":"How much does an exchange cost?","answer":"<p>Exchanges are free for the product itself. However, return shipping fees apply and are based on the weight of the package.<\/p>"}}},"block_order":["question_EqJKCg","question_HteYGX"],"settings":{"title":"Exchanges"}},"collapsible_tabs_aRzKxL":{"type":"collapsible-tabs","blocks":{"question_mYkCCj":{"type":"question","settings":{"title":"What should I do if the product is delivered damaged or defective?","answer":"<p>Please review our return policy<\/p>"}},"question_wczYN8":{"type":"question","settings":{"title":"What should I do if I received the wrong item?","answer":"<p>Follow the same steps as for damaged items: contact us with photos and your order number, and we will send you the correct item free of charge!<\/p>"}},"question_mRje4G":{"type":"question","settings":{"title":"What should I do if an item is missing from my order?","answer":"<p>Please contact us with your order details, and we will work to resolve the issue promptly. Once we confirm the missing item, we will send it to you free of charge!<\/p>"}}},"block_order":["question_mYkCCj","question_wczYN8","question_mRje4G"],"settings":{"title":"Damaged or Incorrect Orders"}},"contact":{"type":"rich-text","blocks":{"icon":{"type":"icon","settings":{"icon":"chat_bubble"}},"heading":{"type":"heading","settings":{"title":"Contact us","use_h1":false}},"text":{"type":"text","settings":{"text":"<p>If you still need personalized support, feel free to reach out to us!<\/p>","enlarge_text":true}},"button":{"type":"button","settings":{"button_label":"Contact us","button_link":"shopify:\/\/pages\/contact","button_style":"primary"}}},"block_order":["icon","heading","text","button"],"settings":{"height":"medium","text_alignment":"center","full_width":false,"color_scheme":"default"}}},"order":["main","faq-content-1","faq-content-2","collapsible_tabs_GhCD97","collapsible_tabs_kFc87r","collapsible_tabs_aRzKxL","contact"]}